#include<stdio.h>
int main()
{	
	int x; 
	double y;
	//x为利润，y为奖金。 
	
	scanf("%d",&x); 
	if(x>0&&x<=10)
	{	y=x*0.1;
		printf("奖金为%lf万元",y); 
	}
	else if(x>10&&x<20)
	{	y=(x-10)*0.075+10*0.1;
		printf("奖金为%lf万元",y);
	}
	else if(x>=20&&x<=40)
	{	y=(x-20)*0.05+(x-10)*0.075+10*0.1;
		printf("奖金为%lf万元",y);
	}
	else if(x>40&&x<=60)
	{	y=(x-40)*0.03+(x-20)*0.05+(x-10)*0.075+10*0.1;
		printf("奖金为%lf万元",y);
	}
	else if(x>60&&x<=100)
	{	y=(x-60)*0.015+(x-40)*0.03+(x-20)*0.05+(x-10)*0.075+10*0.1;
		printf("奖金为%lf万元",y);
	}
	else if(x>100)
	{	y=(x-100)*0.01+(x-60)*0.015+(x-40)*0.03+(x-20)*0.05+(x-10)*0.075+10*0.1;
		printf("奖金为%lf万元",y);
	 } 
	
	return 0;
	
 } 
